#+Title: Org-mode all the thingz!
#+Author: Nick Anderson
#+Email: nick@cmdln.org
#+PROPERTY: header-args:cfengine3+ :eval never-export
# Export cfengine code block execution output by default
#+PROPERTY: header-args:cfengine3+ :exports both
#+PROPERTY: header-args:sh+ :eval never-export
#+PROPERTY: header-args:shell+ :eval never-export
#+OPTIONS: reveal_center:t reveal_progress:t reveal_history:nil reveal_control:t
#+OPTIONS: reveal_rolling_links:t reveal_keyboard:t reveal_overview:t num:nil
#+OPTIONS: reveal_width:1200 reveal_height:800 tags:nil
# The TOC is a bit much for a slide show IMHO, but maybe you want it when exporting to html
#+OPTIONS: toc:nil
#+REVEAL_MARGIN: 0.1
#+REVEAL_MIN_SCALE: 0.5
#+REVEAL_MAX_SCALE: 2.5
# Available Transitions: default|cube|page|concave|zoom|linear|fade|none.
#+REVEAL_TRANS: fade
#+REVEAL_THEME: night
# This flattens up to x levels deep
#+REVEAL_HLEVEL: 1
#+REVEAL_HEAD_PREAMBLE: <meta name=description" content=Org-mode all the thingz!">
#+REVEAL_POSTAMBLE: <p> Created by Nick Anderson. </p>
#+REVEAL_PLUGINS: (notes)
#+OPTIONS: reveal_single_file:nil

#+DOWNLOADED: https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Org-mode-unicorn.svg/800px-Org-mode-unicorn.svg.png @ 2019-07-19 16:43:44
*** Stored one file per day

#+BEGIN_SRC sh :exports both
  ls ~/org/journal | grep -P "2019-0[345]" | head -n 5
#+END_SRC

#+RESULTS:
| 2019-03-03 |
| 2019-03-06 |
| 2019-03-11 |
| 2019-03-12 |
| 2019-03-14 |

